; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v4 ?v2)
             (pred_5 ?v7 ?v6)
             (pred_11 ?v4 ?v6)
             (pred_6 ?v1 ?v4 )
	     (pred_2 ?v4)
             (pred_12 ?v11)
             (pred_4 ?v7)
             (pred_7 ?v6)
             (pred_1 ?v4)
             (pred_3 ?v7)
             (pred_8 ?v4)
             (pred_10 ))



(:action op_1
:parameters (?v9 ?v8 ?v10 ?v3)
:precondition (and (pred_12 ?v9) (pred_12 ?v8) (pred_4 ?v10) (pred_7 ?v3)
          (pred_9 ?v9 ?v8) (pred_5 ?v10 ?v3)
                   (pred_11 ?v8 ?v3) (pred_2 ?v9) 
                   (pred_1 ?v8) (pred_3 ?v10))
:effect (and  (pred_8 ?v8) (not (pred_1 ?v8))))


(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_12 ?v9) (pred_12 ?v13)
               (pred_2 ?v9) (pred_9 ?v9 ?v13) (pred_8 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v9))))

(:action op_3
:parameters (?v9 ?v10)
:precondition (and (pred_12 ?v9) (pred_4 ?v10) 
                  (pred_2 ?v9) (pred_6 ?v10 ?v9) (pred_10 ))
:effect (and (pred_3 ?v10)
   (not (pred_6 ?v10 ?v9)) (not (pred_10 ))))


(:action op_4
:parameters (?v9 ?v12 ?v5)
:precondition (and (pred_12 ?v9) (pred_4 ?v12) (pred_4 ?v5)
                  (pred_2 ?v9) (pred_3 ?v5) (pred_6 ?v12 ?v9))
:effect (and (pred_3 ?v12) (pred_6 ?v5 ?v9)
        (not (pred_3 ?v5)) (not (pred_6 ?v12 ?v9))))

(:action op_5
:parameters (?v9 ?v10)
:precondition (and (pred_12 ?v9) (pred_4 ?v10) 
                  (pred_2 ?v9) (pred_3 ?v10))
:effect (and (pred_10 ) (pred_6 ?v10 ?v9) (not (pred_3 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_12 obj_10 obj_14 obj_02 obj_15 obj_09 obj_18 obj_11 obj_01 obj_19 obj_05 obj_08 obj_16 obj_13 obj_03
    obj_07 obj_06
    obj_17 obj_04
    )

    (:init
       (pred_10)

       (pred_12 obj_20)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_06)
       (pred_4 obj_17)
       (pred_4 obj_04)

       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_12)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_20)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_11  obj_18 obj_07)
       (pred_11  obj_02 obj_06)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_19)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_03)

       (pred_5  obj_17 obj_07)
       (pred_5  obj_04 obj_06)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_04 obj_20)
       (pred_2 obj_12)
    )

    (:goal (and
       (pred_6 obj_04 obj_03)
    ))
(:constraints
  (always (not (pred_2 obj_19)))
)
)

; plan
1. (op_2 obj_12 obj_20)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_04)
   deleted: (pred_6 obj_04 obj_20) (pred_10)
   added: (pred_3 obj_04)
   goals met: 0 of 1
3. (op_2 obj_20 obj_12)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_12)
   goals met: 0 of 1
4. (op_2 obj_12 obj_15)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_15)
   goals met: 0 of 1
5. (op_2 obj_15 obj_01)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_01)
   goals met: 0 of 1
6. (op_2 obj_01 obj_16)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_13)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_03)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_10) (pred_6 obj_04 obj_03)
   goals met: 1 of 1
